PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_rtc.c
        alarmDateTime->dayOfWeek = CONVERT_BCD_TO_DEC(_FLD2VAL(BACKUP_ALM2_TIME_ALM_DAY, tmpAlarmTime));
        alarmDateTime->dayOfWeekEn =
            ((_FLD2BOOL(BACKUP_ALM2_TIME_ALM_DAY_EN, tmpAlarmTime)) ? CY_RTC_ALARM_ENABLE : CY_RTC_ALARM_DISABLE);

        alarmDateTime->date = CONVERT_BCD_TO_DEC(_FLD2VAL(BACKUP_ALM2_DATE_ALM_DATE, tmpAlarmDate));
        alarmDateTime->dateEn  =
            ((_FLD2BOOL(BACKUP_ALM2_DATE_ALM_DATE_EN, tmpAlarmDate)) ? CY_RTC_ALARM_ENABLE : CY_RTC_ALARM_DISABLE);

        alarmDateTime->month = CONVERT_BCD_TO_DEC(_FLD2VAL(BACKUP_ALM2_DATE_ALM_MON, tmpAlarmDate));
        alarmDateTime->monthEn =
            ((_FLD2BOOL(BACKUP_ALM2_DATE_ALM_MON_EN, tmpAlarmDate)) ? CY_RTC_ALARM_ENABLE : CY_RTC_ALARM_DISABLE);

        alarmDateTime->almEn =
            ((_FLD2BOOL(BACKUP_ALM2_DATE_ALM_EN, tmpAlarmDate)) ? CY_RTC_ALARM_ENABLE : CY_RTC_ALARM_DISABLE);
    }
}


/*******************************************************************************
* Function Name: Cy_RTC_SetDateAndTimeDirect
****************************************************************************//**
*
* Sets the time and date values into the RTC_TIME and RTC_DATE registers using
* direct time parameters.
*
* \param sec The second valid range is [0-59].
*
* \param min The minute valid range is [0-59].
*
* \param hour
* The hour valid range is [0-23]. This parameter should be presented in the
* 24-hour format.
*
* The function reads the current 12/24-hour mode, then converts the hour value
* properly as the mode.
*
* \param date
* The date valid range is [1-31], if the month of February is
* selected as the Month parameter, then the valid range is [0-29].
*
* \param month The month valid range is [1-12].
*
* \param year The year valid range is [0-99].
*
* \return
* A validation check result of date and month. Returns an
* error, if the date range is invalid or the RTC time and date set was
* cancelled: the RTC Write bit was not set, the RTC was synchronizing.
* See \ref cy_en_rtc_status_t.
*
*******************************************************************************/
cy_en_rtc_status_t Cy_RTC_SetDateAndTimeDirect(uint32_t sec, uint32_t min, uint32_t hour,
        uint32_t date, uint32_t month, uint32_t year)
{
    cy_en_rtc_status_t retVal = CY_RTC_BAD_PARAM;
    cy_stc_rtc_config_t curTimeAndDate;
    uint32_t tmpTime;
    uint32_t tmpDate;
    uint32_t interruptState;

    CY_ASSERT_L3(CY_RTC_IS_SEC_VALID(sec));
    CY_ASSERT_L3(CY_RTC_IS_MIN_VALID(min));
    CY_ASSERT_L3(CY_RTC_IS_HOUR_VALID(hour));
    CY_ASSERT_L3(CY_RTC_IS_MONTH_VALID(month));
    CY_ASSERT_L3(CY_RTC_IS_YEAR_SHORT_VALID(year));
    CY_ASSERT_L3(CY_RTC_IS_DATE_VALID(date, Cy_RTC_DaysInMonth(month, year + CY_RTC_TWO_THOUSAND_YEARS)));

    /* Fill the date and time structure */
    curTimeAndDate.sec = sec;
    curTimeAndDate.min = min;

    /* Read the current hour mode */
    Cy_RTC_SyncFromRtc();

    if (CY_RTC_12_HOURS != Cy_RTC_GetHoursFormat())
    {
        curTimeAndDate.hrFormat = CY_RTC_24_HOURS;
        curTimeAndDate.hour = hour;
    }
    else
    {
        curTimeAndDate.hrFormat = CY_RTC_12_HOURS;

        /* Convert the 24-hour format input value into the 12-hour format */
        if (hour >= CY_RTC_HOURS_PER_HALF_DAY)
        {
            /* The current hour is more than 12 or equal 12, in the 24-hour
            *  format. Set the PM bit and convert the hour: hour = hour - 12,
            *  except that the hour is 12.
            */
            curTimeAndDate.hour =
                (hour > CY_RTC_HOURS_PER_HALF_DAY) ? ((uint32_t) hour - CY_RTC_HOURS_PER_HALF_DAY) : hour;

            curTimeAndDate.amPm = CY_RTC_PM;
        }
        else
        {
            /* The current hour is less than 12 AM. The zero hour is equal
            *  to 12:00 AM
            */
            curTimeAndDate.hour = ((hour == 0U) ? CY_RTC_HOURS_PER_HALF_DAY : hour);
            curTimeAndDate.amPm = CY_RTC_AM;
        }
    }
    curTimeAndDate.dayOfWeek = Cy_RTC_ConvertDayOfWeek(date, month, (year + CY_RTC_TWO_THOUSAND_YEARS));
    curTimeAndDate.date = date;
    curTimeAndDate.month = month;
    curTimeAndDate.year = year;

    ConstructTimeDate(&curTimeAndDate, &tmpTime, &tmpDate);

    /* The RTC AHB register can be updated only under condition that the
    *  Write bit is set and the RTC busy bit is cleared (CY_RTC_BUSY = 0).
    */
    interruptState = Cy_SysLib_EnterCriticalSection();
    retVal = Cy_RTC_WriteEnable(CY_RTC_WRITE_ENABLED);
    if (retVal == CY_RTC_SUCCESS)
    {
        BACKUP_RTC_TIME = tmpTime;
        BACKUP_RTC_DATE = tmpDate;

        /* Clear the RTC Write bit to finish RTC register update */
        retVal = Cy_RTC_WriteEnable(CY_RTC_WRITE_DISABLED);
    }
    Cy_SysLib_ExitCriticalSection(interruptState);

    return (retVal);
}


/*******************************************************************************
* Function Name: Cy_RTC_SetAlarmDateAndTimeDirect
****************************************************************************//**
*
* Sets alarm time and date values into the ALMx_TIME and ALMx_DATE
* registers using direct time parameters. ALM_DAY_EN is default 0 (=ignore) for
* this function.
*
* \param sec The alarm second valid range is [0-59].
*
* \param min The alarm minute valid range is [0-59].
*
* \param hour
* The valid range is [0-23].
* This parameter type is always in the 24-hour type. This function reads the
* current 12/24-hour mode, then converts the hour value properly as the mode.
*
* \param date
* The valid range is [1-31], if the month of February is selected as
* the Month parameter, then the valid range is [0-29].
*
* \param month The alarm month valid range is [1-12].
*
* \param alarmIndex
* The alarm index to be configured, see \ref cy_en_rtc_alarm_t.
*
* \return
* A validation check result of date and month. Returns an
* error, if the date range is invalid. See \ref cy_en_rtc_status_t.
*
*******************************************************************************/
cy_en_rtc_status_t Cy_RTC_SetAlarmDateAndTimeDirect(uint32_t sec, uint32_t min, uint32_t hour,
        uint32_t date, uint32_t month, cy_en_rtc_alarm_t alarmIndex)
{
    uint32_t tmpCurrentYear;
    cy_en_rtc_status_t retVal = CY_RTC_BAD_PARAM;
    uint32_t tmpAlarmTime;
    uint32_t tmpAlarmDate;
    uint32_t interruptState;
    cy_stc_rtc_alarm_t alarmDateTime;

