PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_rtc.c
    /* Get the current year value to calculate */
    tmpCurrentYear = CY_RTC_TWO_THOUSAND_YEARS + CONVERT_BCD_TO_DEC(_FLD2VAL(BACKUP_RTC_DATE_RTC_YEAR, BACKUP_RTC_DATE));

    CY_UNUSED_PARAMETER(tmpCurrentYear);

    CY_ASSERT_L3(CY_RTC_IS_SEC_VALID(sec));
    CY_ASSERT_L3(CY_RTC_IS_MIN_VALID(min));
    CY_ASSERT_L3(CY_RTC_IS_HOUR_VALID(hour));
    CY_ASSERT_L3(CY_RTC_IS_MONTH_VALID(month));
    CY_ASSERT_L3(CY_RTC_IS_ALARM_IDX_VALID(alarmIndex));
    CY_ASSERT_L3(CY_RTC_IS_DATE_VALID(date, Cy_RTC_DaysInMonth(month, tmpCurrentYear)));


    /* Read the current time to validate the input parameters */
    Cy_RTC_SyncFromRtc();

    /* Fill the alarm structure */
    alarmDateTime.sec         = sec;
    alarmDateTime.secEn       = CY_RTC_ALARM_ENABLE;
    alarmDateTime.min         = min;
    alarmDateTime.minEn       = CY_RTC_ALARM_ENABLE;
    alarmDateTime.hour        = hour;
    alarmDateTime.hourEn      = CY_RTC_ALARM_ENABLE;
    alarmDateTime.dayOfWeek   = CY_RTC_SUNDAY;
    alarmDateTime.dayOfWeekEn = CY_RTC_ALARM_DISABLE;

    alarmDateTime.date    = date;
    alarmDateTime.dateEn  = CY_RTC_ALARM_ENABLE;
    alarmDateTime.month   = month;
    alarmDateTime.monthEn = CY_RTC_ALARM_ENABLE;
    alarmDateTime.almEn   = CY_RTC_ALARM_ENABLE;

    ConstructAlarmTimeDate(&alarmDateTime, &tmpAlarmTime, &tmpAlarmDate);

    /* The RTC AHB register can be updated only under condition that the
    *  Write bit is set and the RTC busy bit is cleared (CY_RTC_BUSY = 0).
    */
    interruptState = Cy_SysLib_EnterCriticalSection();
    retVal = Cy_RTC_WriteEnable(CY_RTC_WRITE_ENABLED);
    if (retVal == CY_RTC_SUCCESS)
    {
        if (alarmIndex != CY_RTC_ALARM_2)
        {
            BACKUP_ALM1_TIME = tmpAlarmTime;
            BACKUP_ALM1_DATE = tmpAlarmDate;
        }
        else
        {
            BACKUP_ALM2_TIME = tmpAlarmTime;
            BACKUP_ALM2_DATE = tmpAlarmDate;
        }

        /* Clear the RTC Write bit to finish RTC register update */
        retVal = Cy_RTC_WriteEnable(CY_RTC_WRITE_DISABLED);
    }
    Cy_SysLib_ExitCriticalSection(interruptState);

    return (retVal);
}


/*******************************************************************************
* Function Name: Cy_RTC_SetHoursFormat
****************************************************************************//**
*
* Sets the 12/24-hour mode.
*
* \param hoursFormat
* The current hour format, see \ref cy_en_rtc_hours_format_t.
*
* \return
* A validation check result of RTC register update. See \ref cy_en_rtc_status_t.
*
* \note
* Refresh ALARM using \ref Cy_RTC_SetAlarmDateAndTime if it is already enabled
* before calling this API.
*
*******************************************************************************/
cy_en_rtc_status_t Cy_RTC_SetHoursFormat(cy_en_rtc_hours_format_t hoursFormat)
{
    uint32_t curTime;
    cy_en_rtc_status_t retVal = CY_RTC_BAD_PARAM;

    CY_ASSERT_L3(CY_RTC_IS_HRS_FORMAT_VALID(hoursFormat));

    /* Read the current time to validate the input parameters */
    Cy_RTC_SyncFromRtc();
    curTime = BACKUP_RTC_TIME;

    /* Hour format can be changed in condition that current hour format is not
    * the same as requested in function argument
    */
    if (hoursFormat != Cy_RTC_GetHoursFormat())
    {
        uint32_t hourValue;

        /* Convert the current hour value from 24H into the 12H format */
        if (hoursFormat == CY_RTC_12_HOURS)
        {
            hourValue = CONVERT_BCD_TO_DEC(_FLD2VAL(BACKUP_RTC_TIME_RTC_HOUR, curTime));
            if (hourValue >= CY_RTC_HOURS_PER_HALF_DAY)
            {
                /* The current hour is more than 12 or equal 12 in the 24-hour
                *  mode. Set the PM bit and convert the hour: hour = hour - 12.
                */
                hourValue = (uint32_t)(hourValue - CY_RTC_HOURS_PER_HALF_DAY);
                hourValue = ((0U != hourValue) ? hourValue : CY_RTC_HOURS_PER_HALF_DAY);

                curTime = (_CLR_SET_FLD32U(curTime, BACKUP_RTC_TIME_RTC_HOUR, CONVERT_DEC_TO_BCD(hourValue)));
                curTime |= CY_RTC_BACKUP_RTC_TIME_RTC_PM;
            }
            else if (hourValue < 1U)
            {
                /* The current hour in the 24-hour mode is 0 which is equal
                *  to 12:00 AM
                */
                curTime =
                    (_CLR_SET_FLD32U(curTime, BACKUP_RTC_TIME_RTC_HOUR,
                                     CONVERT_DEC_TO_BCD(CY_RTC_HOURS_PER_HALF_DAY)));
                /* Set the AM bit */
                curTime &= ((uint32_t) ~CY_RTC_BACKUP_RTC_TIME_RTC_PM);
            }
            else
            {
                /* The current hour is less than 12 */
                curTime = (_CLR_SET_FLD32U(curTime, BACKUP_RTC_TIME_RTC_HOUR, CONVERT_DEC_TO_BCD(hourValue)));
                curTime &= ((uint32_t) ~CY_RTC_BACKUP_RTC_TIME_RTC_PM);
            }

            curTime |= BACKUP_RTC_TIME_CTRL_12HR_Msk;
        }
        /* Convert the hour value into 24H format value */
        else
        {
            /* Mask the AM/PM bit as the hour value is in [20:16] bits */
            hourValue =
                CONVERT_BCD_TO_DEC(_FLD2VAL(BACKUP_RTC_TIME_RTC_HOUR,
                                            (curTime & (uint32_t) ~CY_RTC_BACKUP_RTC_TIME_RTC_PM)));
            /* Add 12 hours in condition that current time is in PM period */
            if ((hourValue < CY_RTC_HOURS_PER_HALF_DAY) && (0U != (curTime & CY_RTC_BACKUP_RTC_TIME_RTC_PM)))
            {
                hourValue += CY_RTC_HOURS_PER_HALF_DAY;
            }

            /* Current hour is 12 AM which is equal to zero hour in 24-hour format */
            if ((hourValue == CY_RTC_HOURS_PER_HALF_DAY) && (0U == (curTime & CY_RTC_BACKUP_RTC_TIME_RTC_PM)))
            {
                hourValue = 0U;
            }

            curTime = (_CLR_SET_FLD32U(curTime, BACKUP_RTC_TIME_RTC_HOUR, CONVERT_DEC_TO_BCD(hourValue)));
            curTime &= (uint32_t) ~BACKUP_RTC_TIME_CTRL_12HR_Msk;
        }

