PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_rtc.c
    if (callbackParams != NULL)
    {
        switch (mode)
        {
        case CY_SYSPM_CHECK_READY:
        {
            if (CY_RTC_AVAILABLE == Cy_RTC_GetSyncStatus())
            {
                retVal = CY_SYSPM_SUCCESS;
            }
        }
        break;

        case CY_SYSPM_CHECK_FAIL:
        {
            retVal = CY_SYSPM_SUCCESS;
        }
        break;

        case CY_SYSPM_BEFORE_TRANSITION:
        {
            retVal = CY_SYSPM_SUCCESS;
        }
        break;

        case CY_SYSPM_AFTER_TRANSITION:
        {
            retVal = CY_SYSPM_SUCCESS;
        }
        break;

        default:
            /* Unknown state */
            break;
        }
    }
    return (retVal);
}


/*******************************************************************************
* Function Name: Cy_RTC_HibernateCallback
****************************************************************************//**
*
* This function checks the RTC_BUSY bit to avoid data corruption before
* enters the Hibernate mode.
*
* \param callbackParams
* structure with the syspm callback parameters,
* see \ref cy_stc_syspm_callback_params_t.
*
* \param mode
* Callback mode, see \ref cy_en_syspm_callback_mode_t
*
* \return
* The syspm return status, see \ref cy_en_syspm_status_t
*
* \note The *base and *context elements are required to be present in
* the parameter structure because this function uses the SysPm driver
* callback type.
* The SysPm driver callback function type requires implementing the function
* with next parameters and return value:
*
* cy_en_syspm_status_t (*Cy_SysPmCallback)
* (cy_stc_syspm_callback_params_t *callbackParams, cy_en_syspm_callback_mode_t mode);
*
*******************************************************************************/
cy_en_syspm_status_t Cy_RTC_HibernateCallback(const cy_stc_syspm_callback_params_t *callbackParams, cy_en_syspm_callback_mode_t mode)
{
    return (Cy_RTC_DeepSleepCallback(callbackParams, mode));
}


/*******************************************************************************
* Function Name: Cy_RTC_CalibrationControlEnable
****************************************************************************//**
*
* This function writes calibration control register.
*
* \param calib_val
* Calibration value for absolute frequency (at a fixed temperature).
* Each step causes 128 ticks to be added or removed each hour.
*
* \param calib_sign
* Remove or Add ticks, see \ref cy_en_rtc_calib_sign_t
*
* \param calib_sel
* Select calibration wave output signal, see \ref cy_en_rtc_calib_sel_t
*
* \return
* The RTC return status, see \ref cy_en_rtc_status_t
*
*******************************************************************************/
cy_en_rtc_status_t Cy_RTC_CalibrationControlEnable(uint8_t calib_val, cy_en_rtc_calib_sign_t calib_sign, cy_en_rtc_calib_sel_t calib_sel)
{
    cy_en_rtc_status_t retVal = CY_RTC_INVALID_STATE;
    uint32_t interruptState;

    CY_UNUSED_PARAMETER(calib_sel);

    /* The RTC AHB registers can be updated only under condition that the
    *  Write bit is set and the RTC busy bit is cleared (RTC_BUSY = 0).
    */
    interruptState = Cy_SysLib_EnterCriticalSection();
    retVal = Cy_RTC_WriteEnable(CY_RTC_WRITE_ENABLED);
    if (CY_RTC_SUCCESS == retVal)
    {
        BACKUP_CAL_CTL =
            _VAL2FLD(BACKUP_CAL_CTL_CALIB_VAL, calib_val)  |
            _VAL2FLD(BACKUP_CAL_CTL_CALIB_SIGN, (uint32_t)calib_sign) |
#if defined (CY_IP_MXS40SSRSS) || (defined (CY_IP_MXS40SRSS_RTC_VERSION) && (CY_IP_MXS40SRSS_RTC_VERSION >= 2)) || defined (CY_IP_MXS22SRSS)
            _VAL2FLD(BACKUP_CAL_CTL_CAL_SEL, (uint32_t)calib_sel) |
#endif
            _VAL2FLD(BACKUP_CAL_CTL_CAL_OUT, 1U);

        /* Clear the RTC Write bit to finish RTC update */
        retVal = Cy_RTC_WriteEnable(CY_RTC_WRITE_DISABLED);
    }
    Cy_SysLib_ExitCriticalSection(interruptState);

    return (retVal);
}

/*******************************************************************************
* Function Name: Cy_RTC_CalibrationControlDisable
****************************************************************************//**
*
* This function disables the calibration control.
*
* \return
* The RTC return status, see \ref cy_en_rtc_status_t
*
*******************************************************************************/
cy_en_rtc_status_t Cy_RTC_CalibrationControlDisable(void)
{
    cy_en_rtc_status_t retVal = CY_RTC_INVALID_STATE;
    uint32_t interruptState;

    /* The RTC AHB registers can be updated only under condition that the
    *  Write bit is set and the RTC busy bit is cleared (RTC_BUSY = 0).
    */
    interruptState = Cy_SysLib_EnterCriticalSection();
    retVal = Cy_RTC_WriteEnable(CY_RTC_WRITE_ENABLED);
    if (CY_RTC_SUCCESS == retVal)
    {
        BACKUP_CAL_CTL =
            _VAL2FLD(BACKUP_CAL_CTL_CAL_OUT, 0U);

        /* Clear the RTC Write bit to finish RTC update */
        retVal = Cy_RTC_WriteEnable(CY_RTC_WRITE_DISABLED);
    }
    Cy_SysLib_ExitCriticalSection(interruptState);

    return (retVal);
}


/*******************************************************************************
* Function Name: ConstructTimeDate
****************************************************************************//**
*
* Returns BCD time and BCD date in the format used in APIs from individual
* elements passed.
* Converted BCD time(*timeBcd) and BCD date(*dateBcd) are matched with RTC_TIME
* and RTC_DATE bit fields format.
*
* \param timeDate
* The structure of time and date, see \ref cy_stc_rtc_config_t.
*
* \param timeBcd
* The BCD-formatted time variable which has the same bit masks as the
* RTC_TIME register:
*
* [0:6]   - Calendar seconds in BCD, the range 0-59. \n
* [14:8]  - Calendar minutes in BCD, the range 0-59. \n
* [21:16] - Calendar hours in BCD, value depends on the 12/24-hour mode.  \n
* 12HR: [21]:0 = AM, 1 = PM, [20:16] = 1 - 12;   \n
* 24HR: [21:16] = 0-23. \n
* [22]    - Selects the 12/24-hour mode: 1 - 12-hour, 0 - 24-hour.  \n
* [26:24] - A calendar day of the week, the range 1 - 7, where 1 - Sunday. \n
*
* \param dateBcd
* The BCD-formatted time variable which has the same bit masks as the
* RTC_DATE register:
*
* [5:0]   - A calendar day of a month in BCD, the range 1-31.  \n
* [12:8]  - A calendar month in BCD, the range 1-12. \n
* [23:16] - A calendar year in BCD, the range 0-99. \n
*
*******************************************************************************/
static void ConstructTimeDate(cy_stc_rtc_config_t const *timeDate, uint32_t *timeBcd, uint32_t *dateBcd)
{
    uint32_t tmpTime;
    uint32_t tmpDate;

    /* Prepare the RTC TIME value based on the structure obtained */
    tmpTime = (_VAL2FLD(BACKUP_RTC_TIME_RTC_SEC, CONVERT_DEC_TO_BCD(timeDate->sec)));
    tmpTime |= (_VAL2FLD(BACKUP_RTC_TIME_RTC_MIN, CONVERT_DEC_TO_BCD(timeDate->min)));

    /* Read the current hour mode to know how many hour bits to convert.
    *  In the 24-hour mode, the hour value is presented in [21:16] bits in the
    *  BCD format.
    *  In the 12-hour mode, the hour value is presented in [20:16] bits in the
    *  BCD format and bit [21] is present: 0 - AM; 1 - PM.
    */
    if (timeDate->hrFormat != CY_RTC_24_HOURS)
    {
        if (CY_RTC_AM != timeDate->amPm)
        {
            /* Set the PM bit */
            tmpTime |= CY_RTC_BACKUP_RTC_TIME_RTC_PM;
        }
        else
        {
            /* Set the AM bit */
            tmpTime &= ((uint32_t) ~CY_RTC_BACKUP_RTC_TIME_RTC_PM);
        }
        tmpTime |= BACKUP_RTC_TIME_CTRL_12HR_Msk;
        tmpTime |= (_VAL2FLD(BACKUP_RTC_TIME_RTC_HOUR, (CONVERT_DEC_TO_BCD(timeDate->hour) & ((uint32_t) ~CY_RTC_12HRS_PM_BIT))));
    }
    else
    {
        tmpTime &= ((uint32_t) ~BACKUP_RTC_TIME_CTRL_12HR_Msk);
        tmpTime |= (_VAL2FLD(BACKUP_RTC_TIME_RTC_HOUR, CONVERT_DEC_TO_BCD(timeDate->hour)));
    }

    if (timeDate->dayOfWeek == CY_RTC_DAY_AUTO)
    {
        tmpTime |= (_VAL2FLD(BACKUP_RTC_TIME_RTC_DAY, CONVERT_DEC_TO_BCD(Cy_RTC_ConvertDayOfWeek(timeDate->date, timeDate->month, (timeDate->year + CY_RTC_TWO_THOUSAND_YEARS)))));
    }
    else
    {
        tmpTime |= (_VAL2FLD(BACKUP_RTC_TIME_RTC_DAY, CONVERT_DEC_TO_BCD(timeDate->dayOfWeek)));
    }

    /* Prepare the RTC Date value based on the structure obtained */
    tmpDate  = (_VAL2FLD(BACKUP_RTC_DATE_RTC_DATE, CONVERT_DEC_TO_BCD(timeDate->date)));
    tmpDate |= (_VAL2FLD(BACKUP_RTC_DATE_RTC_MON, CONVERT_DEC_TO_BCD(timeDate->month)));
    tmpDate |= (_VAL2FLD(BACKUP_RTC_DATE_RTC_YEAR, CONVERT_DEC_TO_BCD(timeDate->year)));
    /* Update the parameter values with prepared values */
    *timeBcd = tmpTime;
    *dateBcd = tmpDate;
}


